public class Main {
    public static void main(String[] args) {
        int price = 4_000;
        int mile = 20;
        int bonus = price / mile;
        System.out.println("Количество бонусных милль: " + bonus);

        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной милли

        // Рассчитываете количество бонусных милль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}